{
  "_name_or_path": "my-custom-98b-model",
  "_comment": "Optimal model under $5M B200 budget. N ~ 9.78e10 (~98B params) from Chinchilla-style scaling law L(N,D) = 406.4/N^0.34 + 410.7/D^0.29 + 1.69. Architecture uses h=8192, 112 layers, GQA with 64 Q heads / 8 KV heads, SwiGLU MLP with intermediate=28672. Total params ~97.9B.",
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",
  "hidden_size": 8192,
  "intermediate_size": 28672,
  "num_hidden_layers": 112,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "max_position_embeddings": 8192,
  "vocab_size": 128256,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-05,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "rope_theta": 500000.0,
  "initializer_range": 0.02,
  "use_cache": true
}
